## Chapter 7
#### 7.1 : Handling Missing Data
#### 7.2 : Data Transformation
#### 7.3 : String Manipulation

### 7.1 : Handling Missing Data

- Filtering Out Missing Data
> 1. isnull
> 2. notnull
> 3. dropna
- Filling In Missing Data
> 1. fillna

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Filtering Out Missing Data:

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, None])

In [4]:
string_data.isnull()

0    False
1    False
2     True
3     True
dtype: bool

In [5]:
string_data[string_data.isnull()]

2     NaN
3    None
dtype: object

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3         None
dtype: object

In [7]:
string_data.notnull()

0     True
1     True
2    False
3    False
dtype: bool

In [8]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
dtype: object

In [9]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
test=data.dropna()

In [13]:
test

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [15]:
data.dropna(inplace=True)

In [16]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [17]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
data.dropna(axis=0,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
#Filling In Missing Data

In [25]:
df = pd.DataFrame(np.random.randn(7, 3))

In [26]:
df.iloc[:4, 1] = np.nan

In [27]:
df.iloc[:2, 2] = np.nan

In [28]:
df

          0         1         2
0 -0.566232       NaN       NaN
1  1.021952       NaN       NaN
2 -0.249356       NaN -1.659606
3  1.203199       NaN -0.132810
4  0.319434  0.835406  1.640923
5 -0.848790  0.190217 -0.129441
6 -0.383665  0.358295  0.125626

In [31]:
df.fillna(0)

          0         1         2
0 -0.566232  0.000000  0.000000
1  1.021952  0.000000  0.000000
2 -0.249356  0.000000 -1.659606
3  1.203199  0.000000 -0.132810
4  0.319434  0.835406  1.640923
5 -0.848790  0.190217 -0.129441
6 -0.383665  0.358295  0.125626

In [32]:
df.fillna({1:0.5,2:0.7})

          0         1         2
0 -0.566232  0.500000  0.700000
1  1.021952  0.500000  0.700000
2 -0.249356  0.500000 -1.659606
3  1.203199  0.500000 -0.132810
4  0.319434  0.835406  1.640923
5 -0.848790  0.190217 -0.129441
6 -0.383665  0.358295  0.125626


### 7.2 : Data Transformation

- Removing Duplicated
> 1. duplicated
> 2. drop_duplicated
- Transforming Data Using a Function or Mapping
> 1. map
- Replacing Values
> 1. replace
- Renaming Axis Indexes
> 1. rename
- Discretization And Binning
> 1. cut
- Detecting And Filtering Outliers

In [ ]:
# Removing Duplicated

In [57]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 1, 3, 3, 4, 4]})

In [58]:
data

    k1  k2
0  one   1
1  two   1
2  one   1
3  two   3
4  one   3
5  two   4
6  two   4

In [68]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [69]:
data[data.duplicated()]

Empty DataFrame
Columns: [k1, k2, v1]
Index: []

In [70]:
data.drop_duplicates()

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [72]:
data['v1'] = range(7)

In [73]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [78]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [79]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [80]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
6  two   4   6

In [ ]:
#Transforming Data Using A Function Or Mapping

In [81]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [82]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [83]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [84]:
lowercased = data['food'].str.lower()

In [85]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [88]:
data['animal'] = lowercased.map(meat_to_animal)

In [89]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [91]:
data['animal']=data['food'].map(lambda x: meat_to_animal[x.lower()]) #one line code

In [92]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [93]:
#Replacing Values

In [94]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [95]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [96]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [97]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [98]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [99]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
#Discretization and Binning

In [100]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [102]:
bins = [18, 25, 35, 60, 100]

In [105]:
cats = pd.cut(ages, bins)

In [104]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [108]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [109]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [110]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
#Detecting and Filtering Outliers

In [111]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [112]:
data

            0         1         2         3
0    1.024124  0.651099 -0.668591 -0.653728
1    0.455326 -1.191704 -2.894177 -0.181265
2   -0.118684 -0.368458  0.944659 -0.025086
3    1.216986 -0.996118 -0.447795  0.513124
4    0.463643  0.743118 -0.519152 -0.827495
..        ...       ...       ...       ...
995 -0.905218  0.741204 -2.237160 -1.782790
996 -0.670706 -0.839923  0.562687  1.123922
997  0.401476 -1.007940  0.142714  0.647093
998  1.533371  0.433584 -0.879774 -0.012570
999 -0.330737 -0.010787  0.608130 -0.366977

[1000 rows x 4 columns]

In [113]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.010299     0.012917     0.008864     0.007951
std       0.999607     1.037014     1.014468     1.004875
min      -2.919716    -3.195642    -2.953406    -2.810897
25%      -0.710329    -0.706962    -0.709455    -0.714874
50%      -0.011369     0.007235     0.036062    -0.026025
75%       0.690547     0.707060     0.669611     0.673349
max       3.171113     3.573640     2.816595     3.116157

In [116]:
col = data[1]

In [117]:
col

0      0.651099
1     -1.191704
2     -0.368458
3     -0.996118
4      0.743118
         ...
995    0.741204
996   -0.839923
997   -1.007940
998    0.433584
999   -0.010787
Name: 1, Length: 1000, dtype: float64

In [118]:
col[np.abs(col) > 3]

11     3.015001
409   -3.125686
688    3.165760
898   -3.195642
900    3.573640
954    3.050834
Name: 1, dtype: float64

In [119]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
11   0.822561  3.015001 -0.081812 -0.009926
409 -0.259610 -3.125686  0.634402 -0.766583
471 -1.886130 -2.082851  0.041983  3.116157
546  3.171113 -0.559432  0.560604  2.237306
634  1.393012 -0.890873  0.612551  3.003984
688  0.189714  3.165760 -0.024342  0.594415
841  3.162551 -0.066312  0.584374  0.128888
853  0.292999 -1.354569 -0.163627  3.046399
898 -1.064588 -3.195642  1.029007  0.124015
900  2.304064  3.573640 -0.047985 -0.317592
902  3.039997  1.268747  0.665484  0.721883
954  0.893083  3.050834 -1.287535 -0.459246

In [121]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [123]:
np.sign(data)

       0    1    2    3
0    1.0  1.0 -1.0 -1.0
1    1.0 -1.0 -1.0 -1.0
2   -1.0 -1.0  1.0 -1.0
3    1.0 -1.0 -1.0  1.0
4    1.0  1.0 -1.0 -1.0
..   ...  ...  ...  ...
995 -1.0  1.0 -1.0 -1.0
996 -1.0 -1.0  1.0  1.0
997  1.0 -1.0  1.0  1.0
998  1.0  1.0 -1.0 -1.0
999 -1.0 -1.0  1.0 -1.0

[1000 rows x 4 columns]

In [122]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.010673     0.012433     0.008864     0.007785
std       0.998451     1.033552     1.014468     1.004371
min      -2.919716    -3.000000    -2.953406    -2.810897
25%      -0.710329    -0.706962    -0.709455    -0.714874
50%      -0.011369     0.007235     0.036062    -0.026025
75%       0.690547     0.707060     0.669611     0.673349
max       3.000000     3.000000     2.816595     3.000000



### 7.3 : String Manipulation

- Regular Expressions
> 1. regex

In [ ]:
#Regular Expressions

In [128]:
import re
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._+-]+@[A-Z0-9.-]+.[A-Z]{2,4}'  #text@text.pk

In [129]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [130]:
regex

re.compile(r'[A-Z0-9._+-]+@[A-Z0-9.-]+.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [131]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']